#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
int Q1012();	//1월 1일. 유기농 배추
int Q1927();	//1월 1일_2. 최소 힙
int Q11279();	//1월 3일. 최대 힙
int Q11286();	//1월 3일_2. 절대값 힙
int Q2587();	//1월 3일_3. 대표값2
int Q11724();	//1월 3일_4. 연결 요소의 개수
int Q2839();	//1월 6일. 설탕 배달
int Q1463();	//1월 6일_2. 1로 만들기
int Q9095();	//1월 7일. 1,2,3 더하기
int Q2775();	//1월 7일_2. 부녀회장이 될테야 DP
int Q1149();	//1월 11일. RGB거리
int Q1991();	//1월 13일. 트리 순회 (구현)
int Q11725();	//1월 14일. 트리의 부모 찾기
int Q1167();	//1월 17일. 트리의 지름
int Q1068();	//1월 19일. 트리



int main()
{
	Q1068();
	system("pause");
	return 0;
}